RIOT-OS/RIOT/cpu/k60/include/vendor/MK60DZ10.h
/* STCTRLH Bit Fields */
#define WDOG_STCTRLH_WDOGEN_MASK                 0x1u
#define WDOG_STCTRLH_WDOGEN_SHIFT                0
#define WDOG_STCTRLH_CLKSRC_MASK                 0x2u
#define WDOG_STCTRLH_CLKSRC_SHIFT                1
#define WDOG_STCTRLH_IRQRSTEN_MASK               0x4u
#define WDOG_STCTRLH_IRQRSTEN_SHIFT              2
#define WDOG_STCTRLH_WINEN_MASK                  0x8u
#define WDOG_STCTRLH_WINEN_SHIFT                 3
#define WDOG_STCTRLH_ALLOWUPDATE_MASK            0x10u
#define WDOG_STCTRLH_ALLOWUPDATE_SHIFT           4
#define WDOG_STCTRLH_DBGEN_MASK                  0x20u
#define WDOG_STCTRLH_DBGEN_SHIFT                 5
#define WDOG_STCTRLH_STOPEN_MASK                 0x40u
#define WDOG_STCTRLH_STOPEN_SHIFT                6
#define WDOG_STCTRLH_WAITEN_MASK                 0x80u
#define WDOG_STCTRLH_WAITEN_SHIFT                7
#define WDOG_STCTRLH_STNDBYEN_MASK               0x100u
#define WDOG_STCTRLH_STNDBYEN_SHIFT              8
#define WDOG_STCTRLH_TESTWDOG_MASK               0x400u
#define WDOG_STCTRLH_TESTWDOG_SHIFT              10
#define WDOG_STCTRLH_TESTSEL_MASK                0x800u
#define WDOG_STCTRLH_TESTSEL_SHIFT               11
#define WDOG_STCTRLH_BYTESEL_MASK                0x3000u
#define WDOG_STCTRLH_BYTESEL_SHIFT               12
#define WDOG_STCTRLH_BYTESEL(x)                  (((uint16_t)(((uint16_t)(x))<<WDOG_STCTRLH_BYTESEL_SHIFT))&WDOG_STCTRLH_BYTESEL_MASK)
#define WDOG_STCTRLH_DISTESTWDOG_MASK            0x4000u
#define WDOG_STCTRLH_DISTESTWDOG_SHIFT           14
/* STCTRLL Bit Fields */
#define WDOG_STCTRLL_INTFLG_MASK                 0x8000u
#define WDOG_STCTRLL_INTFLG_SHIFT                15
/* TOVALH Bit Fields */
#define WDOG_TOVALH_TOVALHIGH_MASK               0xFFFFu
#define WDOG_TOVALH_TOVALHIGH_SHIFT              0
#define WDOG_TOVALH_TOVALHIGH(x)                 (((uint16_t)(((uint16_t)(x))<<WDOG_TOVALH_TOVALHIGH_SHIFT))&WDOG_TOVALH_TOVALHIGH_MASK)
/* TOVALL Bit Fields */
#define WDOG_TOVALL_TOVALLOW_MASK                0xFFFFu
#define WDOG_TOVALL_TOVALLOW_SHIFT               0
#define WDOG_TOVALL_TOVALLOW(x)                  (((uint16_t)(((uint16_t)(x))<<WDOG_TOVALL_TOVALLOW_SHIFT))&WDOG_TOVALL_TOVALLOW_MASK)
/* WINH Bit Fields */
#define WDOG_WINH_WINHIGH_MASK                   0xFFFFu
#define WDOG_WINH_WINHIGH_SHIFT                  0
#define WDOG_WINH_WINHIGH(x)                     (((uint16_t)(((uint16_t)(x))<<WDOG_WINH_WINHIGH_SHIFT))&WDOG_WINH_WINHIGH_MASK)
/* WINL Bit Fields */
#define WDOG_WINL_WINLOW_MASK                    0xFFFFu
#define WDOG_WINL_WINLOW_SHIFT                   0
#define WDOG_WINL_WINLOW(x)                      (((uint16_t)(((uint16_t)(x))<<WDOG_WINL_WINLOW_SHIFT))&WDOG_WINL_WINLOW_MASK)
/* REFRESH Bit Fields */
#define WDOG_REFRESH_WDOGREFRESH_MASK            0xFFFFu
#define WDOG_REFRESH_WDOGREFRESH_SHIFT           0
#define WDOG_REFRESH_WDOGREFRESH(x)              (((uint16_t)(((uint16_t)(x))<<WDOG_REFRESH_WDOGREFRESH_SHIFT))&WDOG_REFRESH_WDOGREFRESH_MASK)
/* UNLOCK Bit Fields */
#define WDOG_UNLOCK_WDOGUNLOCK_MASK              0xFFFFu
#define WDOG_UNLOCK_WDOGUNLOCK_SHIFT             0
#define WDOG_UNLOCK_WDOGUNLOCK(x)                (((uint16_t)(((uint16_t)(x))<<WDOG_UNLOCK_WDOGUNLOCK_SHIFT))&WDOG_UNLOCK_WDOGUNLOCK_MASK)
/* TMROUTH Bit Fields */
#define WDOG_TMROUTH_TIMEROUTHIGH_MASK           0xFFFFu
#define WDOG_TMROUTH_TIMEROUTHIGH_SHIFT          0
#define WDOG_TMROUTH_TIMEROUTHIGH(x)             (((uint16_t)(((uint16_t)(x))<<WDOG_TMROUTH_TIMEROUTHIGH_SHIFT))&WDOG_TMROUTH_TIMEROUTHIGH_MASK)
/* TMROUTL Bit Fields */
#define WDOG_TMROUTL_TIMEROUTLOW_MASK            0xFFFFu
#define WDOG_TMROUTL_TIMEROUTLOW_SHIFT           0
#define WDOG_TMROUTL_TIMEROUTLOW(x)              (((uint16_t)(((uint16_t)(x))<<WDOG_TMROUTL_TIMEROUTLOW_SHIFT))&WDOG_TMROUTL_TIMEROUTLOW_MASK)
/* RSTCNT Bit Fields */
#define WDOG_RSTCNT_RSTCNT_MASK                  0xFFFFu
#define WDOG_RSTCNT_RSTCNT_SHIFT                 0
#define WDOG_RSTCNT_RSTCNT(x)                    (((uint16_t)(((uint16_t)(x))<<WDOG_RSTCNT_RSTCNT_SHIFT))&WDOG_RSTCNT_RSTCNT_MASK)
/* PRESC Bit Fields */
#define WDOG_PRESC_PRESCVAL_MASK                 0x700u
#define WDOG_PRESC_PRESCVAL_SHIFT                8
#define WDOG_PRESC_PRESCVAL(x)                   (((uint16_t)(((uint16_t)(x))<<WDOG_PRESC_PRESCVAL_SHIFT))&WDOG_PRESC_PRESCVAL_MASK)

/**
 * @}
 */ /* end of group WDOG_Register_Masks */


/* WDOG - Peripheral instance base addresses */
/** Peripheral WDOG base address */
#define WDOG_BASE                                (0x40052000u)
/** Peripheral WDOG base pointer */
#define WDOG                                     ((WDOG_Type *)WDOG_BASE)

/**
 * @}
 */ /* end of group WDOG_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/**
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define FB_CSCR_EXALE_MASK                       FB_CSCR_EXTS_MASK
#define FB_CSCR_EXALE_SHIFT                      FB_CSCR_EXTS_SHIFT
#define RTC_CCR_CONFIG_MASK                      This_symb_has_been_deprecated
#define RTC_CCR_CONFIG_SHIFT                     This_symb_has_been_deprecated
#define RTC_CCR_CONFIG                           This_symb_has_been_deprecated
#define RTC_WAR_CCRW_MASK                        This_symb_has_been_deprecated
#define RTC_WAR_CCRW_SHIFT                       This_symb_has_been_deprecated
#define RTC_RAR_CCRR_MASK                        This_symb_has_been_deprecated
#define RTC_RAR_CCRR_SHIFT                       This_symb_has_been_deprecated
#define SIM_FCFG1_FSIZE_MASK                     This_symb_has_been_deprecated
#define SIM_FCFG1_FSIZE_SHIFT                    This_symb_has_been_deprecated
#define I2S_CR_SSIEN_MASK                        I2S_CR_I2SEN_MASK
#define I2S_CR_SSIEN_SHIFT                       I2S_CR_I2SEN_SHIFT
#define SDHC_VENDOR_VOLTSEL_MASK                 This_symb_has_been_deprecated
#define SDHC_VENDOR_VOLTSEL_SHIFT                This_symb_has_been_deprecated
#define INT_Reserved4                            INT_Mem_Manage_Fault
#define TSI_CNTR1_CNTN_MASK                      TSI_CNTR1_CTN1_MASK
#define TSI_CNTR1_CNTN_SHIFT                     TSI_CNTR1_CTN1_SHIFT
#define TSI_CNTR1_CNTN(x)                        TSI_CNTR1_CTN1(x)
#define TSI_CNTR1_CNTN1_MASK                     TSI_CNTR1_CTN_MASK
#define TSI_CNTR1_CNTN1_SHIFT                    TSI_CNTR1_CTN_SHIFT
#define TSI_CNTR1_CNTN1(x)                       TSI_CNTR1_CTN(x)
#define TSI_CNTR3_CNTN_MASK                      TSI_CNTR3_CTN1_MASK
#define TSI_CNTR3_CNTN_SHIFT                     TSI_CNTR3_CTN1_SHIFT
#define TSI_CNTR3_CNTN(x)                        TSI_CNTR3_CTN1(x)
#define TSI_CNTR3_CNTN1_MASK                     TSI_CNTR3_CTN_MASK
#define TSI_CNTR3_CNTN1_SHIFT                    TSI_CNTR3_CTN_SHIFT
#define TSI_CNTR3_CNTN1(x)                       TSI_CNTR3_CTN(x)
#define TSI_CNTR5_CNTN_MASK                      TSI_CNTR5_CTN1_MASK
#define TSI_CNTR5_CNTN_SHIFT                     TSI_CNTR5_CTN1_SHIFT
#define TSI_CNTR5_CNTN(x)                        TSI_CNTR5_CTN1(x)
#define TSI_CNTR5_CNTN1_MASK                     TSI_CNTR5_CTN_MASK
#define TSI_CNTR5_CNTN1_SHIFT                    TSI_CNTR5_CTN_SHIFT
#define TSI_CNTR5_CNTN1(x)                       TSI_CNTR5_CTN(x)
#define TSI_CNTR7_CNTN_MASK                      TSI_CNTR7_CTN1_MASK
#define TSI_CNTR7_CNTN_SHIFT                     TSI_CNTR7_CTN1_SHIFT
#define TSI_CNTR7_CNTN(x)                        TSI_CNTR7_CTN1(x)
#define TSI_CNTR7_CNTN1_MASK                     TSI_CNTR7_CTN_MASK
#define TSI_CNTR7_CNTN1_SHIFT                    TSI_CNTR7_CTN_SHIFT
#define TSI_CNTR7_CNTN1(x)                       TSI_CNTR7_CTN(x)
#define TSI_CNTR9_CNTN_MASK                      TSI_CNTR9_CTN1_MASK
#define TSI_CNTR9_CNTN_SHIFT                     TSI_CNTR9_CTN1_SHIFT
#define TSI_CNTR9_CNTN(x)                        TSI_CNTR9_CTN1(x)
#define TSI_CNTR9_CNTN1_MASK                     TSI_CNTR9_CTN_MASK
#define TSI_CNTR9_CNTN1_SHIFT                    TSI_CNTR9_CTN_SHIFT
#define TSI_CNTR9_CNTN1(x)                       TSI_CNTR9_CTN(x)
#define TSI_CNTR11_CNTN_MASK                     TSI_CNTR11_CTN1_MASK
#define TSI_CNTR11_CNTN_SHIFT                    TSI_CNTR11_CTN1_SHIFT
#define TSI_CNTR11_CNTN(x)                       TSI_CNTR11_CTN1(x)
#define TSI_CNTR11_CNTN1_MASK                    TSI_CNTR11_CTN_MASK
#define TSI_CNTR11_CNTN1_SHIFT                   TSI_CNTR11_CTN_SHIFT
#define TSI_CNTR11_CNTN1(x)                      TSI_CNTR11_CTN(x)
#define TSI_CNTR13_CNTN_MASK                     TSI_CNTR13_CTN1_MASK
#define TSI_CNTR13_CNTN_SHIFT                    TSI_CNTR13_CTN1_SHIFT
#define TSI_CNTR13_CNTN(x)                       TSI_CNTR13_CTN1(x)
#define TSI_CNTR13_CNTN1_MASK                    TSI_CNTR13_CTN_MASK
#define TSI_CNTR13_CNTN1_SHIFT                   TSI_CNTR13_CTN_SHIFT
#define TSI_CNTR13_CNTN1(x)                      TSI_CNTR13_CTN(x)
#define TSI_CNTR15_CNTN_MASK                     TSI_CNTR15_CTN1_MASK
#define TSI_CNTR15_CNTN_SHIFT                    TSI_CNTR15_CTN1_SHIFT
#define TSI_CNTR15_CNTN(x)                       TSI_CNTR15_CTN1(x)
#define TSI_CNTR15_CNTN1_MASK                    TSI_CNTR15_CTN_MASK
#define TSI_CNTR15_CNTN1_SHIFT                   TSI_CNTR15_CTN_SHIFT
#define TSI_CNTR15_CNTN1(x)                      TSI_CNTR15_CTN(x)

/**
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#endif  /* #if !defined(MK60DZ10_H_) */

#ifdef __cplusplus
}
#endif

/* MK60DZ10.h, eof. */
